20250829-195049_-zfs-ssd-sas-raid10_dbstore_test4k_randread_4k_arc_off.txt
randread_4k: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.39
Starting 8 processes

randread_4k: (groupid=0, jobs=8): err= 0: pid=2363810: Fri Aug 29 20:01:58 2025
  read: IOPS=285k, BW=1114MiB/s (1168MB/s)(65.3GiB/60001msec)
    slat (nsec): min=1216, max=63961k, avg=26363.50, stdev=248168.83
    clat (nsec): min=1833, max=384901k, avg=1767628.46, stdev=3061647.21
     lat (usec): min=4, max=385523, avg=1793.99, stdev=3100.32
    clat percentiles (usec):
     |  1.00th=[   898],  5.00th=[  1037], 10.00th=[  1123], 20.00th=[  1254],
     | 30.00th=[  1385], 40.00th=[  1500], 50.00th=[  1631], 60.00th=[  1778],
     | 70.00th=[  1942], 80.00th=[  2114], 90.00th=[  2245], 95.00th=[  2343],
     | 99.00th=[  2474], 99.50th=[  2606], 99.90th=[ 40109], 99.95th=[ 73925],
     | 99.99th=[131597]
   bw (  MiB/s): min=   32, max= 1848, per=100.00%, avg=1114.25, stdev=45.52, samples=960
   iops        : min= 8368, max=473262, avg=285246.85, stdev=11652.91, samples=960
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.06%, 1000=3.42%
  lat (msec)   : 2=70.54%, 4=25.68%, 10=0.11%, 20=0.05%, 50=0.05%
  lat (msec)   : 100=0.05%, 250=0.03%, 500=0.01%
  cpu          : usr=6.20%, sys=34.06%, ctx=11144574, majf=0, minf=573
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=17114816,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=1114MiB/s (1168MB/s), 1114MiB/s-1114MiB/s (1168MB/s-1168MB/s), io=65.3GiB (70.1GB), run=60001-60001msec