20250829-195049_-zfs-ssd-sas-raid10_dbstore_test4k_randwrite_4k_arc_off.txt
randwrite_4k: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.39
Starting 8 processes

randwrite_4k: (groupid=0, jobs=8): err= 0: pid=2365359: Fri Aug 29 20:06:16 2025
  write: IOPS=851k, BW=3325MiB/s (3486MB/s)(195GiB/60001msec); 0 zone resets
    slat (nsec): min=1966, max=20410k, avg=8037.13, stdev=31592.99
    clat (usec): min=2, max=28855, avg=592.85, stdev=369.83
     lat (usec): min=6, max=28862, avg=600.88, stdev=373.15
    clat percentiles (usec):
     |  1.00th=[  375],  5.00th=[  404], 10.00th=[  420], 20.00th=[  441],
     | 30.00th=[  461], 40.00th=[  482], 50.00th=[  506], 60.00th=[  537],
     | 70.00th=[  594], 80.00th=[  701], 90.00th=[  889], 95.00th=[  988],
     | 99.00th=[ 1205], 99.50th=[ 1909], 99.90th=[ 5342], 99.95th=[ 7242],
     | 99.99th=[12518]
   bw (  MiB/s): min= 1776, max= 4879, per=99.93%, avg=3322.30, stdev=103.02, samples=960
   iops        : min=454728, max=1249176, avg=850507.75, stdev=26373.54, samples=960
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=48.44%, 750=34.47%, 1000=12.54%
  lat (msec)   : 2=4.07%, 4=0.28%, 10=0.17%, 20=0.02%, 50=0.01%
  cpu          : usr=11.68%, sys=84.09%, ctx=88923, majf=0, minf=59
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,51066689,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=3325MiB/s (3486MB/s), 3325MiB/s-3325MiB/s (3486MB/s-3486MB/s), io=195GiB (209GB), run=60001-60001msec