20250829-195049_-zfs-ssd-sas-raid10_dbstore_test4k_randwrite_4k_arc_on.txt
randwrite_4k: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.39
Starting 8 processes

randwrite_4k: (groupid=0, jobs=8): err= 0: pid=2352628: Fri Aug 29 19:56:26 2025
  write: IOPS=851k, BW=3323MiB/s (3484MB/s)(195GiB/60010msec); 0 zone resets
    slat (nsec): min=1948, max=30053k, avg=8005.12, stdev=40873.55
    clat (usec): min=2, max=30571, avg=593.05, stdev=438.62
     lat (usec): min=6, max=30576, avg=601.05, stdev=442.25
    clat percentiles (usec):
     |  1.00th=[  367],  5.00th=[  396], 10.00th=[  408], 20.00th=[  433],
     | 30.00th=[  449], 40.00th=[  469], 50.00th=[  494], 60.00th=[  529],
     | 70.00th=[  586], 80.00th=[  709], 90.00th=[  881], 95.00th=[  988],
     | 99.00th=[ 1287], 99.50th=[ 2573], 99.90th=[ 6652], 99.95th=[ 8717],
     | 99.99th=[14746]
   bw (  MiB/s): min= 1753, max= 4882, per=99.89%, avg=3319.43, stdev=101.98, samples=960
   iops        : min=448814, max=1249909, avg=849772.44, stdev=26107.35, samples=960
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=52.03%, 750=30.76%, 1000=12.56%
  lat (msec)   : 2=4.03%, 4=0.34%, 10=0.26%, 20=0.03%, 50=0.01%
  cpu          : usr=11.91%, sys=82.35%, ctx=96802, majf=0, minf=56
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,51050528,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=3323MiB/s (3484MB/s), 3323MiB/s-3323MiB/s (3484MB/s-3484MB/s), io=195GiB (209GB), run=60010-60010msec