20250829-195049_-zfs-ssd-sas-raid10_dbstore_test4k_read_128k_arc_off.txt
read_128k: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=64
...
fio-3.39
Starting 8 processes

read_128k: (groupid=0, jobs=8): err= 0: pid=2372448: Fri Aug 29 20:08:36 2025
  read: IOPS=46.5k, BW=5819MiB/s (6101MB/s)(341GiB/60035msec)
    slat (usec): min=24, max=775471, avg=170.51, stdev=4155.58
    clat (usec): min=8, max=779355, avg=10825.89, stdev=33177.26
     lat (usec): min=1873, max=779425, avg=10996.40, stdev=33439.58
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    7], 90.00th=[    8], 95.00th=[   39],
     | 99.00th=[  159], 99.50th=[  243], 99.90th=[  326], 99.95th=[  550],
     | 99.99th=[  776]
   bw (  MiB/s): min=  639, max= 9531, per=100.00%, avg=5863.99, stdev=230.65, samples=953
   iops        : min= 5112, max=76252, avg=46911.90, stdev=1845.23, samples=953
  lat (usec)   : 10=0.01%, 20=0.01%
  lat (msec)   : 2=0.10%, 4=41.88%, 10=51.27%, 20=1.04%, 50=1.02%
  lat (msec)   : 100=2.27%, 250=1.93%, 500=0.42%, 750=0.05%, 1000=0.02%
  cpu          : usr=0.67%, sys=53.80%, ctx=1502447, majf=0, minf=16454
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=2794624,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=5819MiB/s (6101MB/s), 5819MiB/s-5819MiB/s (6101MB/s-6101MB/s), io=341GiB (366GB), run=60035-60035msec