20250829-195049_-zfs-ssd-sas-raid10_dbstore_test4k_write_128k_arc_off.txt
write_128k: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=64
...
fio-3.39
Starting 8 processes

write_128k: (groupid=0, jobs=8): err= 0: pid=2373997: Fri Aug 29 20:10:38 2025
  write: IOPS=34.8k, BW=4353MiB/s (4564MB/s)(255GiB/60007msec); 0 zone resets
    slat (usec): min=33, max=45195, avg=226.83, stdev=458.31
    clat (usec): min=3, max=78118, avg=14473.00, stdev=3645.19
     lat (usec): min=245, max=80990, avg=14699.83, stdev=3675.33
    clat percentiles (usec):
     |  1.00th=[ 5604],  5.00th=[ 9372], 10.00th=[11338], 20.00th=[13173],
     | 30.00th=[13698], 40.00th=[13960], 50.00th=[14091], 60.00th=[14222],
     | 70.00th=[14222], 80.00th=[15533], 90.00th=[18220], 95.00th=[21103],
     | 99.00th=[27919], 99.50th=[31327], 99.90th=[39584], 99.95th=[44303],
     | 99.99th=[54264]
   bw (  MiB/s): min= 3088, max= 5951, per=99.93%, avg=4349.62, stdev=53.46, samples=957
   iops        : min=24706, max=47612, avg=34795.96, stdev=427.76, samples=957
  lat (usec)   : 4=0.01%, 10=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=6.97%, 20=86.67%, 50=6.33%
  lat (msec)   : 100=0.02%
  cpu          : usr=5.95%, sys=51.99%, ctx=15098052, majf=0, minf=59
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,2089505,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=4353MiB/s (4564MB/s), 4353MiB/s-4353MiB/s (4564MB/s-4564MB/s), io=255GiB (274GB), run=60007-60007msec