20250829-195049_-zfs-ssd-sas-raid10_dbstore_test4k_write_128k_arc_on.txt
write_128k: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=64
...
fio-3.39
Starting 8 processes

write_128k: (groupid=0, jobs=8): err= 0: pid=2361220: Fri Aug 29 20:00:44 2025
  write: IOPS=34.4k, BW=4302MiB/s (4511MB/s)(252GiB/60009msec); 0 zone resets
    slat (usec): min=32, max=44368, avg=229.63, stdev=463.15
    clat (usec): min=2, max=68537, avg=14643.56, stdev=3692.65
     lat (usec): min=54, max=68628, avg=14873.19, stdev=3721.25
    clat percentiles (usec):
     |  1.00th=[ 5604],  5.00th=[ 9634], 10.00th=[11863], 20.00th=[13304],
     | 30.00th=[13829], 40.00th=[13960], 50.00th=[14091], 60.00th=[14222],
     | 70.00th=[14222], 80.00th=[15795], 90.00th=[18482], 95.00th=[21103],
     | 99.00th=[28705], 99.50th=[32375], 99.90th=[41157], 99.95th=[46400],
     | 99.99th=[55837]
   bw (  MiB/s): min= 3189, max= 5249, per=99.91%, avg=4298.02, stdev=46.45, samples=957
   iops        : min=25514, max=41994, avg=34382.94, stdev=371.68, samples=957
  lat (usec)   : 4=0.01%, 10=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=5.50%, 20=88.08%, 50=6.38%
  lat (msec)   : 100=0.03%
  cpu          : usr=5.76%, sys=52.22%, ctx=15269392, majf=0, minf=65
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,2065224,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=4302MiB/s (4511MB/s), 4302MiB/s-4302MiB/s (4511MB/s-4511MB/s), io=252GiB (271GB), run=60009-60009msec